In [32]:
import pandas as pd
import pickle

In [33]:
citi_info = pd.read_csv('./temperature_precipitation_data/city_info.csv')

In [34]:
#Creates variables that find file names that start with "US" to read in all data
filesnames = os.listdir('./temperature_precipitation_data/')
filesnames = [f for f in filesnames if (f.startswith("US") and f.lower().endswith(".csv"))]

In [35]:
# Reads in all relevant data and appends to list 
# https://stackoverflow.com/questions/58071982/read-csv-in-a-for-loop-using-pandas
dfs = list()
for filename in filesnames:
     df = pd.read_csv(f'./temperature_precipitation_data/{filename}')
     #creates a new column with csv file name
     df['csv'] = f'{filename}'
     #creates column name place holder with corresponding identifier. example: "USW00023188"
     df['name'] = df['csv'].map(lambda x: str(x)[:-4])
     #appends each fixed dataframe into dfs list
     dfs.append(df)

In [36]:
#Creates one dataframe from all read data
new_df = pd.concat(dfs)

In [37]:
#checking to see if correctly set name to ID
new_df['name'].value_counts()

USW00023188    62092
USW00094298    60266
USW00013873    59535
USW00014836    57344
USW00014792    56613
               ...
USW00013958    44925
USW00014827    44925
USW00094236    44925
USW00003927    44560
USW00003103    44560
Name: name, Length: 210, dtype: int64

In [38]:
#checks for columns in different dataframe with ID and Name
citi_info.head()

,Unnamed: 0,Name,ID,Lat,Lon,Stn.Name,Stn.stDate,Stn.edDate
0,1,Lander,USW00024021,42.8153,-108.7261,LANDER WBO,1892-01-01,1946-05-28
1,2,Lander,USW00024021,42.8153,-108.7261,LANDER HUNT FIELD,1946-05-29,2020-12-31
2,3,Cheyenne,USW00024018,41.1519,-104.8061,CHEYENNE WBO,1871-01-01,1935-08-31
3,4,Cheyenne,USW00024018,41.1519,-104.8061,CHEYENNE MUNICIPAL ARPT,1935-09-01,2020-12-31
4,5,Wausau,USW00014897,44.9258,-89.6256,Wausau Record Herald,1896-01-01,1941-12-31

In [39]:
#zips ID and Name into dicitonary
name_id = dict(zip(citi_info['ID'], citi_info['Name']))

In [40]:
#replaces 'name' column value with corresponding city name
new_df.replace({'name': name_id}, inplace=True)

In [41]:
#checking to see if all citys made it in. 
new_df['name'].value_counts()

SanDiego           62092
Vancouver          60266
Athens             59535
Lansing            57344
Trenton            56613
                   ...
FortWayne          44925
Saginaw            44925
Austin             44925
Flagstaff          44560
DallasFortWorth    44560
Name: name, Length: 210, dtype: int64

In [42]:
new_df.head(3)

   Unnamed: 0        Date  tmax  tmin  prcp              csv      name
0           1  1871-01-01   NaN   NaN   0.0  USW00003822.csv  Savannah
1           2  1871-01-02   NaN   NaN   0.0  USW00003822.csv  Savannah
2           3  1871-01-03   NaN   NaN   0.0  USW00003822.csv  Savannah

In [43]:
new_df.drop('Unnamed: 0', axis=1, inplace=True)

In [44]:
#temp = pd.read_csv('./temperature_precipitation_data/merged_temp.csv')

In [45]:
new_df['Date'] = pd.to_datetime(new_df['Date'])

In [52]:
final_csv = new_df[new_df['Date']>'2001-12-22']
#df_filtered = df[df['Age'] >= 25]

In [53]:
final_csv.head()

            Date  tmax  tmin  prcp              csv      name
47838 2001-12-23  70.0  43.0  0.00  USW00003822.csv  Savannah
47839 2001-12-24  64.0  38.0  0.04  USW00003822.csv  Savannah
47840 2001-12-25  46.0  36.0  0.00  USW00003822.csv  Savannah
47841 2001-12-26  49.0  30.0  0.00  USW00003822.csv  Savannah
47842 2001-12-27  53.0  24.0  0.00  USW00003822.csv  Savannah

In [54]:
final_csv['name'].value_counts().sum()

1459290

In [55]:
#save merged data
final_csv.to_pickle('./temperature_precipitation_data/merged_temp.pkl')